A = int(input("Введите рост в дюймах: "))
B = int(input("Введите вес в фунтах: "))
C = (B * 703) / A**2
D = round(C, 2)
if D < 16:
    print('Выраженный дефицит массы тела')
elif D > 16 and D < 18.49:
    print('Недостаточный дефицит массы тела')
elif D > 18.5 and D < 24.49:
    print('Норма')
elif D > 25 and D < 29.99:
    print('Избыточная масса тела')
elif D > 30 and D < 34.99:
    print('Ожирение первой степени')
elif D > 35 and D < 39.99:
    print('Ожирение второй степени')
elif D > 40 and D < 100:
    print('Ожирение третьей степени')
elif D > 100:
    print('Бро ты умрешь и тд')