a = input('Здравствуйте! Как Вас зовут? ')
print('Очень приятно', a, 'меня зовут Марк')
b = int(input('Сколько вам лет? '))
if b < 86 :
    print(a, 'я старше вас на ', 86 - b, 'лет')
elif b > 86 :
    c = 86 - b
    d = c * -1
    print(a, 'я младше вас на ', d ,  'лет')
elif b == 86 :
    print(a, "мы ровесники!")
e = str(input("Вам нравится программировать? "))
if e == 'да' :
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
elif e == 'нет' :
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.  ')
else:
    print('Введите только да или нет')