a = str(input("Собака короткошострной породы? "))
b = str(input('Рост собаки менее 50 см? '))
if a == 'да':
    if b == 'нет':
        c = str(input('Собака весит более 50 кг? '))
        if c == 'да':
            print('датский дог')
        elif c == 'нет':
            print('фоксхаунд')
    elif b == 'да':
        d = str(input('У собаки короткий хвост? '))
        if d == 'да':
            print('английский бульдог')
        elif d == 'нет':
            e = str(input("У собаки длинные уши? "))
            if e == 'да':
                print('гончая')
            elif e == 'нет':
                ab = str(input('У собаки короткое тело? '))
                if ab == 'да':
                    print('мопс')
                if ab == 'нет':
                    print('чихуахуа')
if a == 'нет':
    if b == 'да':
        ba = str(input('У собаки доброжелательный характер? '))
        if ba == 'да':
            print('кокер-спаниель')
        elif ba == 'нет':
            print('ирландский сеттер')
    if b == 'нет':
        ca = str(input('У собаки рост менее 70 см? '))
        if ca == 'да':
            da = str(input('У собаки длинные уши?'))
            if da == 'да':
                print('большой вандейский грифон')
            elif da == 'нет':
                print('колли')
        if ca == 'нет':
            ea = str(input("Окрас рыжий с белыми отметинами?"))
            if ea == 'да':
                print('сенбернар')
            if ea == 'нет':
                fe = str(input('Белоснежный окрас?'))
                if fe == 'да':
                    print("ирландский волкодав")
                elif fe == 'нет':
                    print("ньюфаундленд")
